app/Controllers/Admin.php

SELECT *
FROM `products`
ORDER BY `id` DESC
 LIMIT 50, 50
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT *
FROM `products`
 LIMIT 50
---
    public function index()
    {

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $product = $this->productModel->search($keyword);
        } else {
            $product = $this->productModel;
        }

        $data = [
            'tittle' => "Data List",
            'product' => $product->paginate(50, 'products'),
            'pager' => $this->productModel->pager
        ];