app/Controllers/Home.php

    public function index()
    {
        $productdata = $this->productModel->findAll();
        $jumlah_baris = $this->productModel->countAll(); // Menghitung jumlah baris pada tabel

        // Mengambil data produk yang telah diurutkan berdasarkan jumlah secara descending (terbanyak dulu)
        // dan dibatasi hanya 10 data produk yang paling banyak
        $jumlah_per_product = $this->productModel->select('COUNT(id) AS jumlah, product')
            ->groupBy('product')
            ->orderBy('jumlah', 'DESC')
            ->limit(10)
            ->findAll();


            //untuk menghitung total quantity
            $productModel = new ProductModel();
            $products = $productModel->findAll(); // Mengambil semua data produk
            $totalQuantity = 0; // Inisialisasi total quantity dengan nilai 0

            foreach ($products as $product) {
                $totalQuantity += $product['quantity']; // Menambahkan nilai quantity ke total quantity
            }
            //untuk menghitung total quantity
            $products1 = $productModel->findAll(); // Mengambil semua data produk
---
SELECT *
FROM `products`
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(id) AS jumlah, `product`
FROM `products`
GROUP BY `product`
ORDER BY `jumlah` DESC