app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'bunga@gmail.com'
 LIMIT 1
---
    public function create()
    {
        $validate = $this->validate([
            'username' => 'required',
            'password' => 'required|min_length[6]'
        ]);
        if (!$validate) {
            $this->session->setFlashdata("errors", $this->validator->listErrors());
            return redirect()->to('/login')->withInput();
        }
        $username = $this->request->getPost('username');
        $password = (string) $this->request->getPost('password');

        $user = $this->userModel
            ->where('username', $username)
            ->first();